{
    "format": "layers-model",
    "generatedBy": "keras v2.5.0",
    "convertedBy": "TensorFlow.js Converter v3.8.0",
    "modelTopology": {
      "keras_version": "2.5.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "Model",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  34
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_4"
              }
            },
            {
              "class_name": "Activation",
              "config": {
                "name": "activation_12",
                "trainable": true,
                "dtype": "float32",
                "activation": "relu"
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_9",
                "trainable": true,
                "dtype": "float32",
                "units": 100,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Activation",
              "config": {
                "name": "activation_13",
                "trainable": true,
                "dtype": "float32",
                "activation": "relu"
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_3",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.3,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_10",
                "trainable": true,
                "dtype": "float32",
                "units": 34,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Activation",
              "config": {
                "name": "activation_14",
                "trainable": true,
                "dtype": "float32",
                "activation": "relu"
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_11",
                "trainable": true,
                "dtype": "float32",
                "units": 2,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Activation",
              "config": {
                "name": "activation_15",
                "trainable": true,
                "dtype": "float32",
                "activation": "softmax"
              }
            }
          ]
        }
      },
      "training_config": {
        "loss": "binary_crossentropy",
        "metrics": [
          [
            {
              "class_name": "MeanMetricWrapper",
              "config": {
                "name": "accuracy",
                "dtype": "float32",
                "fn": "categorical_accuracy"
              }
            }
          ]
        ],
        "weighted_metrics": null,
        "loss_weights": null,
        "optimizer_config": {
          "class_name": "Adam",
          "config": {
            "name": "Adam",
            "learning_rate": 0.0010000000474974513,
            "decay": 0,
            "beta_1": 0.8999999761581421,
            "beta_2": 0.9990000128746033,
            "epsilon": 1e-7,
            "amsgrad": false
          }
        }
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of1.bin"
        ],
        "weights": [
          {
            "name": "dense_10/kernel",
            "shape": [
              100,
              34
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_10/bias",
            "shape": [
              34
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_11/kernel",
            "shape": [
              34,
              2
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_11/bias",
            "shape": [
              2
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_9/kernel",
            "shape": [
              34,
              100
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_9/bias",
            "shape": [
              100
            ],
            "dtype": "float32"
          }
        ]
      }
    ]
  }